---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLevelInfo.GetRelatedElements
source: html/32b7f154-857e-83f2-7fa7-f512c5330d1b.htm
---
# Autodesk.Revit.DB.IFC.IFCLevelInfo.GetRelatedElements Method

Gets all building elements on this level.

## Syntax (C#)
```csharp
public ICollection<IFCAnyHandle> GetRelatedElements()
```

## Returns
The collection of elements.